src/test/resources/GetVersionRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hl7="http://hl7.umcg.nl">
   <soapenv:Header/>
   <soapenv:Body>
      <hl7:GetVersion/>
   </soapenv:Body>
</soapenv:Envelope>